Revit 2027 API
XYZ.Normalize Method
Returns a new XYZ whose coordinates are the normalized values from this vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Normalize()
Public Function Normalize As XYZ
public:
XYZ^ Normalize()
member Normalize : unit -> XYZ
Return Value
XYZ
The normalized XYZ or zero if the vector is almost Zero.
Remarks
 Normalized indicates that the length of this vector equals one (a unit vector).
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace